app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "rates".* FROM "rates"  WHERE "rates"."courier_id" = $1 AND "rates"."normHour" = 1 LIMIT 1  [["courier_id", 1]]
SELECT  "companies".* FROM "companies"  WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "couriers".* FROM "couriers"  WHERE "couriers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "rates".* FROM "rates"  WHERE "rates"."courier_id" = $1 AND "rates"."id" = $2 LIMIT 1  [["courier_id", 1], ["id", 1]]
---
    def new
        @distance = Order.find(1).distance
        @oneHour = current_user.company.courier.rates.find_by(normHour:1)
        @twoHour = current_user.company.courier.rates.find_by(normHour:2)
        @fourHour = current_user.company.courier.rates.find_by(normHour:4)
        @sixHour = current_user.company.courier.rates.find_by(normHour:6)
        @eightHour = current_user.company.courier.rates.find_by(normHour:8)
        @twelveHour = current_user.company.courier.rates.find_by(normHour:12)
        @oneTotal = (@distance - 1) * @oneHour.normPerMile + @oneHour.normFirst
        @twoTotal = (@distance - 1) * @twoHour.normPerMile + @twoHour.normFirst
        @fourTotal = (@distance - 1) * @fourHour.normPerMile + @fourHour.normFirst
        @sixTotal = (@distance - 1) * @sixHour.normPerMile + @sixHour.normFirst
        @eightTotal = (@distance - 1) * @eightHour.normPerMile + @eightHour.normFirst
        @twelveTotal = (@distance - 1) * @twelveHour.normPerMile + @twelveHour.normFirst
        @company = Company.find(current_user.company.id)