app/controllers/sessions_controller.rb

	def create
		user = User.find_by_email(login_params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'chayden@gmail.com' LIMIT 1