app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first", "last", "password_digest", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		user = User.new(user_params)
		if user.save